Revit 2026 API

# ViewHasViewTransforms Method

---

Returns true if the view reports model space to view projection space transforms.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasViewTransforms()
```
```vb
Public Function HasViewTransforms As Boolean
```
```cpp
public:
bool HasViewTransforms()
```
```fsharp
member HasViewTransforms : unit -> bool
```

#### Return Value

Boolean True if the view returns transforms, false otherwise.

Not all views return transforms. For example, schedules and legends do not report transforms.

#### Reference

View Class

Autodesk.Revit.DB Namespace